Kimdowne/auto-marine-inspect-bot/tcp_scripts/STM32/JetBot_F401/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define TRACK_L_IN1_Pin GPIO_PIN_0
#define TRACK_L_IN1_GPIO_Port GPIOA
#define TRACK_L_IN2_Pin GPIO_PIN_1
#define TRACK_L_IN2_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define TRACK_R_IN1_Pin GPIO_PIN_4
#define TRACK_R_IN1_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TRACK_L_PWM_Pin GPIO_PIN_6
#define TRACK_L_PWM_GPIO_Port GPIOA
#define TRACK_R_PWM_Pin GPIO_PIN_7
#define TRACK_R_PWM_GPIO_Port GPIOA
#define TRACK_R_IN2_Pin GPIO_PIN_0
#define TRACK_R_IN2_GPIO_Port GPIOB
#define SERVO_SHOULDER_PWM_Pin GPIO_PIN_8
#define SERVO_SHOULDER_PWM_GPIO_Port GPIOA
#define SERVO_ELBOW_PWM_Pin GPIO_PIN_9
#define SERVO_ELBOW_PWM_GPIO_Port GPIOA
#define SERVO_GRIPPER_PWM_Pin GPIO_PIN_10
#define SERVO_GRIPPER_PWM_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define ARM_DC_IN1_Pin GPIO_PIN_4
#define ARM_DC_IN1_GPIO_Port GPIOB
#define ARM_DC_IN2_Pin GPIO_PIN_5
#define ARM_DC_IN2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
